###################################################################

# Created by write_sdc on Fri Jan 22 18:28:11 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {Address_instruction[31]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[30]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[29]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[28]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[27]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[26]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[25]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[24]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[23]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[22]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[21]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[20]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[19]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[18]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[17]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[16]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[15]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[14]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[13]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[12]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[11]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[10]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[9]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[8]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[7]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[6]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[5]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[4]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[3]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[2]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[1]}]
set_load -pin_load 3.40189 [get_ports {Address_instruction[0]}]
set_load -pin_load 3.40189 [get_ports {Address_data[31]}]
set_load -pin_load 3.40189 [get_ports {Address_data[30]}]
set_load -pin_load 3.40189 [get_ports {Address_data[29]}]
set_load -pin_load 3.40189 [get_ports {Address_data[28]}]
set_load -pin_load 3.40189 [get_ports {Address_data[27]}]
set_load -pin_load 3.40189 [get_ports {Address_data[26]}]
set_load -pin_load 3.40189 [get_ports {Address_data[25]}]
set_load -pin_load 3.40189 [get_ports {Address_data[24]}]
set_load -pin_load 3.40189 [get_ports {Address_data[23]}]
set_load -pin_load 3.40189 [get_ports {Address_data[22]}]
set_load -pin_load 3.40189 [get_ports {Address_data[21]}]
set_load -pin_load 3.40189 [get_ports {Address_data[20]}]
set_load -pin_load 3.40189 [get_ports {Address_data[19]}]
set_load -pin_load 3.40189 [get_ports {Address_data[18]}]
set_load -pin_load 3.40189 [get_ports {Address_data[17]}]
set_load -pin_load 3.40189 [get_ports {Address_data[16]}]
set_load -pin_load 3.40189 [get_ports {Address_data[15]}]
set_load -pin_load 3.40189 [get_ports {Address_data[14]}]
set_load -pin_load 3.40189 [get_ports {Address_data[13]}]
set_load -pin_load 3.40189 [get_ports {Address_data[12]}]
set_load -pin_load 3.40189 [get_ports {Address_data[11]}]
set_load -pin_load 3.40189 [get_ports {Address_data[10]}]
set_load -pin_load 3.40189 [get_ports {Address_data[9]}]
set_load -pin_load 3.40189 [get_ports {Address_data[8]}]
set_load -pin_load 3.40189 [get_ports {Address_data[7]}]
set_load -pin_load 3.40189 [get_ports {Address_data[6]}]
set_load -pin_load 3.40189 [get_ports {Address_data[5]}]
set_load -pin_load 3.40189 [get_ports {Address_data[4]}]
set_load -pin_load 3.40189 [get_ports {Address_data[3]}]
set_load -pin_load 3.40189 [get_ports {Address_data[2]}]
set_load -pin_load 3.40189 [get_ports {Address_data[1]}]
set_load -pin_load 3.40189 [get_ports {Address_data[0]}]
set_load -pin_load 3.40189 [get_ports {Data_write[31]}]
set_load -pin_load 3.40189 [get_ports {Data_write[30]}]
set_load -pin_load 3.40189 [get_ports {Data_write[29]}]
set_load -pin_load 3.40189 [get_ports {Data_write[28]}]
set_load -pin_load 3.40189 [get_ports {Data_write[27]}]
set_load -pin_load 3.40189 [get_ports {Data_write[26]}]
set_load -pin_load 3.40189 [get_ports {Data_write[25]}]
set_load -pin_load 3.40189 [get_ports {Data_write[24]}]
set_load -pin_load 3.40189 [get_ports {Data_write[23]}]
set_load -pin_load 3.40189 [get_ports {Data_write[22]}]
set_load -pin_load 3.40189 [get_ports {Data_write[21]}]
set_load -pin_load 3.40189 [get_ports {Data_write[20]}]
set_load -pin_load 3.40189 [get_ports {Data_write[19]}]
set_load -pin_load 3.40189 [get_ports {Data_write[18]}]
set_load -pin_load 3.40189 [get_ports {Data_write[17]}]
set_load -pin_load 3.40189 [get_ports {Data_write[16]}]
set_load -pin_load 3.40189 [get_ports {Data_write[15]}]
set_load -pin_load 3.40189 [get_ports {Data_write[14]}]
set_load -pin_load 3.40189 [get_ports {Data_write[13]}]
set_load -pin_load 3.40189 [get_ports {Data_write[12]}]
set_load -pin_load 3.40189 [get_ports {Data_write[11]}]
set_load -pin_load 3.40189 [get_ports {Data_write[10]}]
set_load -pin_load 3.40189 [get_ports {Data_write[9]}]
set_load -pin_load 3.40189 [get_ports {Data_write[8]}]
set_load -pin_load 3.40189 [get_ports {Data_write[7]}]
set_load -pin_load 3.40189 [get_ports {Data_write[6]}]
set_load -pin_load 3.40189 [get_ports {Data_write[5]}]
set_load -pin_load 3.40189 [get_ports {Data_write[4]}]
set_load -pin_load 3.40189 [get_ports {Data_write[3]}]
set_load -pin_load 3.40189 [get_ports {Data_write[2]}]
set_load -pin_load 3.40189 [get_ports {Data_write[1]}]
set_load -pin_load 3.40189 [get_ports {Data_write[0]}]
set_load -pin_load 3.40189 [get_ports Wr_MEM_cntrl]
create_clock [get_ports Clk]  -name MY_CLK  -period 14  -waveform {0 7}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports reset]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Code_instruction[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {Data_from_memory[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_instruction[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Address_data[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {Data_write[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports Wr_MEM_cntrl]
